In [1]:
import pandas as pd

#Series -: 1D
#Dataframes -: 2D
#Penal -:3D

In [2]:
m=[1,2,3,4,5]
marks=pd.Series(m)
print(marks)  #gives default index

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
marks=[1,2,3,4]
name=['A', 'B', 'C', 'D']
m=pd.Series(marks, index=name)
print(m)

print(m['A'])

A    1
B    2
C    3
D    4
dtype: int64
1

In [4]:
l1=[23,3,4,45,45]
l2=[34,23,22,56,34]
marks = pd.DataFrame([l1,l2], index=['A', 'B'], columns=[1,2,3,4,5])
print(marks)

    1   2   3   4   5
A  23   3   4  45  45
B  34  23  22  56  34

In [5]:
data =  pd.read_csv("C:\\Users\\Shyam Singh\\Downloads\\DIM_MATCH.xlsx - Sheet1.csv")
data

,Match_SK,match_id,Team1,Team2,match_date,Season_Year,Venue_Name,City_Name,Country_Name,Toss_Winner,match_winner,Toss_Name,Win_Type,Outcome_Type,ManOfMach,Win_Margin,Country_id
0,546,980964,Royal Challengers Bangalore,Kolkata Knight Riders,5/2/2016,2016,M Chinnaswamy Stadium,Bangalore,India,Kolkata Knight Riders,Kolkata Knight Riders,field,wickets,Result,AD Russell,5.0,1
1,547,980966,Gujarat Lions,Delhi Daredevils,5/3/2016,2016,Saurashtra Cricket Association Stadium,Rajkot,India,Delhi Daredevils,Delhi Daredevils,field,wickets,Result,RR Pant,8.0,1
2,548,980968,Kolkata Knight Riders,Kings XI Punjab,5/4/2016,2016,Eden Gardens,Kolkata,India,Kings XI Punjab,Kolkata Knight Riders,field,runs,Result,AD Russell,7.0,1
3,549,980970,Delhi Daredevils,Rising Pune Supergiants,5/5/2016,2016,Feroz Shah Kotla,Delhi,India,Rising Pune Supergiants,Rising Pune Supergiants,field,wickets,Result,AM Rahane,7.0,1
4,550,980972,Sunrisers Hyderabad,Gujarat Lions,5/6/2016,2016,"Rajiv Gandhi International Stadium, Uppal",Hyderabad,India,Sunrisers Hyderabad,Sunrisers Hyderabad,field,wickets,Result,B Kumar,5.0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
632,541,980954,Rising Pune Supergiants,Gujarat Lions,4/29/2016,2016,Maharashtra Cricket Association Stadium,Pune,India,Gujarat Lions,Gujarat Lions,field,wickets,Result,DR Smith,3.0,1
633,542,980956,Delhi Daredevils,Kolkata Knight Riders,4/30/2016,2016,Feroz Shah Kotla,Delhi,India,Kolkata Knight Riders,Delhi Daredevils,field,runs,Result,CR Brathwaite,27.0,1
634,543,980958,Sunrisers Hyderabad,Royal Challengers Bangalore,4/30/2016,2016,"Rajiv Gandhi International Stadium, Uppal",Hyderabad,India,Royal Challengers Bangalore,Sunrisers Hyderabad,field,runs,Result,DA Warner,15.0,1
635,544,980960,Gujarat Lions,Kings XI Punjab,5/1/2016,2016,Saurashtra Cricket Association Stadium,Rajkot,India,Gujarat Lions,Kings XI Punjab,field,runs,Result,AR Patel,23.0,1
636,545,980962,Rising Pune Supergiants,Mumbai Indians,5/1/2016,2016,Maharashtra Cricket Association Stadium,Pune,India,Mumbai Indians,Mumbai Indians,field,wickets,Result,RG Sharma,8.0,1

In [6]:
d=data.loc[0,'Team1'] # for getting using original index
e=data.iloc[0, 1]     # for getting only using normal indexes
print(d)
print(e)

Royal Challengers Bangalore
980964

In [7]:
# data1=pd.read_excel("C:\\Users\\Shyam Singh\\Downloads\\SampleTemperature Sheet.xlsx")
# data1.head()

In [8]:
data=pd.read_csv("C:\\Users\\Shyam Singh\\Downloads\\DJIA_table.csv")
data

,Date,Open,High,Low,Close,Volume,Adj Close
0,2016-07-01,17924.240234,18002.380859,17916.910156,17949.369141,82160000,17949.369141
1,2016-06-30,17712.759766,17930.609375,17711.800781,17929.990234,133030000,17929.990234
2,2016-06-29,17456.019531,17704.509766,17456.019531,17694.679688,106380000,17694.679688
3,2016-06-28,17190.509766,17409.720703,17190.509766,17409.720703,112190000,17409.720703
4,2016-06-27,17355.210938,17355.210938,17063.080078,17140.240234,138740000,17140.240234
...,...,...,...,...,...,...,...
1984,2008-08-14,11532.070312,11718.280273,11450.889648,11615.929688,159790000,11615.929688
1985,2008-08-13,11632.809570,11633.780273,11453.339844,11532.959961,182550000,11532.959961
1986,2008-08-12,11781.700195,11782.349609,11601.519531,11642.469727,173590000,11642.469727
1987,2008-08-11,11729.669922,11867.110352,11675.530273,11782.349609,183190000,11782.349609
1988,2008-08-08,11432.089844,11759.959961,11388.040039,11734.320312,212830000,11734.320312

In [9]:
data.info()  #meta data info.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1989 entries, 0 to 1988
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       1989 non-null   object
 1   Open       1989 non-null   float64
 2   High       1989 non-null   float64
 3   Low        1989 non-null   float64
 4   Close      1989 non-null   float64
 5   Volume     1989 non-null   int64
 6   Adj Close  1989 non-null   float64
dtypes: float64(5), int64(1), object(1)
memory usage: 108.9+ KB

In [10]:
data.shape

(1989, 7)

In [11]:
data.index

RangeIndex(start=0, stop=1989, step=1)

In [12]:
data.columns

Index(['Date', 'Open', 'High', 'Low', 'Close', 'Volume', 'Adj Close'], dtype='object')

In [13]:
data.count()

Date         1989
Open         1989
High         1989
Low          1989
Close        1989
Volume       1989
Adj Close    1989
dtype: int64

In [14]:
data.sum()

Date         2016-07-012016-06-302016-06-292016-06-282016-0...
Open                                           26770181.820295
High                                           26933652.010742
Low                                            26598761.206535
Close                                          26777971.154794
Volume                                            323831020000
Adj Close                                      26777971.154794
dtype: object

In [15]:
data.cumsum()

,Date,Open,High,Low,Close,Volume,Adj Close
0,2016-07-01,1.792424e+04,1.800238e+04,1.791691e+04,1.794937e+04,82160000,1.794937e+04
1,2016-07-012016-06-30,3.563700e+04,3.593299e+04,3.562871e+04,3.587936e+04,215190000,3.587936e+04
2,2016-07-012016-06-302016-06-29,5.309302e+04,5.363750e+04,5.308473e+04,5.357404e+04,321570000,5.357404e+04
3,2016-07-012016-06-302016-06-292016-06-28,7.028353e+04,7.104722e+04,7.027524e+04,7.098376e+04,433760000,7.098376e+04
4,2016-07-012016-06-302016-06-292016-06-282016-0...,8.763874e+04,8.840243e+04,8.733832e+04,8.812400e+04,572500000,8.812400e+04
...,...,...,...,...,...,...,...
1984,2016-07-012016-06-302016-06-292016-06-282016-0...,2.672361e+07,2.688661e+07,2.655264e+07,2.673128e+07,323078860000,2.673128e+07
1985,2016-07-012016-06-302016-06-292016-06-282016-0...,2.673524e+07,2.689824e+07,2.656410e+07,2.674281e+07,323261410000,2.674281e+07
1986,2016-07-012016-06-302016-06-292016-06-282016-0...,2.674702e+07,2.691002e+07,2.657570e+07,2.675445e+07,323435000000,2.675445e+07
1987,2016-07-012016-06-302016-06-292016-06-282016-0...,2.675875e+07,2.692189e+07,2.658737e+07,2.676624e+07,323618190000,2.676624e+07
1988,2016-07-012016-06-302016-06-292016-06-282016-0...,2.677018e+07,2.693365e+07,2.659876e+07,2.677797e+07,323831020000,2.677797e+07

In [16]:
data.mean()

C:\Users\Shyam Singh\AppData\Local\Temp\ipykernel_8980\531903386.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  data.mean()

Open         1.345912e+04
High         1.354130e+04
Low          1.337293e+04
Close        1.346303e+04
Volume       1.628110e+08
Adj Close    1.346303e+04
dtype: float64

In [17]:
data.min()
# data.max()

Date          2008-08-08
Open         6547.009766
High         6709.609863
Low          6469.950195
Close        6547.049805
Volume           8410000
Adj Close    6547.049805
dtype: object

In [18]:
# data.describe()  #show only for the numerical data type
data.describe().T #transpose the data.describe

,count,mean,std,min,25%,50%,75%,max
Open,1989.0,1.345912e+04,3.143282e+03,6.547010e+03,1.090734e+04,1.302205e+04,1.647770e+04,1.831506e+04
High,1989.0,1.354130e+04,3.136272e+03,6.709610e+03,1.100098e+04,1.308811e+04,1.655007e+04,1.835136e+04
Low,1989.0,1.337293e+04,3.150421e+03,6.469950e+03,1.082476e+04,1.295313e+04,1.639277e+04,1.827256e+04
Close,1989.0,1.346303e+04,3.144007e+03,6.547050e+03,1.091338e+04,1.302558e+04,1.647841e+04,1.831239e+04
Volume,1989.0,1.628110e+08,9.392343e+07,8.410000e+06,1.000000e+08,1.351700e+08,1.926000e+08,6.749200e+08
Adj Close,1989.0,1.346303e+04,3.144007e+03,6.547050e+03,1.091338e+04,1.302558e+04,1.647841e+04,1.831239e+04

In [19]:
data.head(10)  #gives top 10 values

,Date,Open,High,Low,Close,Volume,Adj Close
0,2016-07-01,17924.240234,18002.380859,17916.910156,17949.369141,82160000,17949.369141
1,2016-06-30,17712.759766,17930.609375,17711.800781,17929.990234,133030000,17929.990234
2,2016-06-29,17456.019531,17704.509766,17456.019531,17694.679688,106380000,17694.679688
3,2016-06-28,17190.509766,17409.720703,17190.509766,17409.720703,112190000,17409.720703
4,2016-06-27,17355.210938,17355.210938,17063.080078,17140.240234,138740000,17140.240234
5,2016-06-24,17946.630859,17946.630859,17356.339844,17400.750000,239000000,17400.750000
6,2016-06-23,17844.109375,18011.070312,17844.109375,18011.070312,98070000,18011.070312
7,2016-06-22,17832.669922,17920.160156,17770.359375,17780.830078,89440000,17780.830078
8,2016-06-21,17827.330078,17877.839844,17799.800781,17829.730469,85130000,17829.730469
9,2016-06-20,17736.869141,17946.359375,17736.869141,17804.869141,99380000,17804.869141

In [20]:
data.tail(10)

,Date,Open,High,Low,Close,Volume,Adj Close
1979,2008-08-21,11415.230469,11476.209961,11315.570312,11430.209961,130020000,11430.209961
1980,2008-08-20,11345.940430,11454.150391,11290.580078,11417.429688,144880000,11417.429688
1981,2008-08-19,11478.089844,11478.169922,11318.500000,11348.549805,171580000,11348.549805
1982,2008-08-18,11659.650391,11690.429688,11434.120117,11479.389648,156290000,11479.389648
1983,2008-08-15,11611.209961,11709.889648,11599.730469,11659.900391,215040000,11659.900391
1984,2008-08-14,11532.070312,11718.280273,11450.889648,11615.929688,159790000,11615.929688
1985,2008-08-13,11632.809570,11633.780273,11453.339844,11532.959961,182550000,11532.959961
1986,2008-08-12,11781.700195,11782.349609,11601.519531,11642.469727,173590000,11642.469727
1987,2008-08-11,11729.669922,11867.110352,11675.530273,11782.349609,183190000,11782.349609
1988,2008-08-08,11432.089844,11759.959961,11388.040039,11734.320312,212830000,11734.320312

In [21]:
data.describe(include=[int], percentiles=[0.2, 0.4, 0.6])

             Volume
count  1.989000e+03
mean   1.628110e+08
std    9.392343e+07
min    8.410000e+06
20%    9.293800e+07
40%    1.198180e+08
50%    1.351700e+08
60%    1.539340e+08
max    6.749200e+08

In [22]:
data.mean()

C:\Users\Shyam Singh\AppData\Local\Temp\ipykernel_8980\531903386.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  data.mean()

Open         1.345912e+04
High         1.354130e+04
Low          1.337293e+04
Close        1.346303e+04
Volume       1.628110e+08
Adj Close    1.346303e+04
dtype: float64

In [23]:
data.describe(include=[int], percentiles=[0.2, 0.4, 0.6])

             Volume
count  1.989000e+03
mean   1.628110e+08
std    9.392343e+07
min    8.410000e+06
20%    9.293800e+07
40%    1.198180e+08
50%    1.351700e+08
60%    1.539340e+08
max    6.749200e+08

In [24]:
data2=data.copy()
data2.loc[3:5, 'High']=None  #include 3,4,5 with 3 rows only in loc func
data2.iloc[3:4, 3]=None
data2.isnull().sum()

Date         0
Open         0
High         3
Low          1
Close        0
Volume       0
Adj Close    0
dtype: int64

In [25]:
data2.isnull().sum().sum()

4

In [26]:
# print(data2.dropna()) #row-wise delete if we want to delete in original data then use inplace=True as a parameter
print(data2.dropna(axis=1)) #column-wise delete

            Date          Open         Close     Volume     Adj Close
0     2016-07-01  17924.240234  17949.369141   82160000  17949.369141
1     2016-06-30  17712.759766  17929.990234  133030000  17929.990234
2     2016-06-29  17456.019531  17694.679688  106380000  17694.679688
3     2016-06-28  17190.509766  17409.720703  112190000  17409.720703
4     2016-06-27  17355.210938  17140.240234  138740000  17140.240234
...          ...           ...           ...        ...           ...
1984  2008-08-14  11532.070312  11615.929688  159790000  11615.929688
1985  2008-08-13  11632.809570  11532.959961  182550000  11532.959961
1986  2008-08-12  11781.700195  11642.469727  173590000  11642.469727
1987  2008-08-11  11729.669922  11782.349609  183190000  11782.349609
1988  2008-08-08  11432.089844  11734.320312  212830000  11734.320312

[1989 rows x 5 columns]

In [27]:
data2.iloc[3:4, 3]=None

In [28]:
print(data2.fillna(data2.High.mean()))  #fill the values(mean of high) in the place of NaN values

            Date          Open          High           Low         Close  \
0     2016-07-01  17924.240234  18002.380859  17916.910156  17949.369141
1     2016-06-30  17712.759766  17930.609375  17711.800781  17929.990234
2     2016-06-29  17456.019531  17704.509766  17456.019531  17694.679688
3     2016-06-28  17190.509766  13535.216741  13535.216741  17409.720703
4     2016-06-27  17355.210938  13535.216741  17063.080078  17140.240234
...          ...           ...           ...           ...           ...
1984  2008-08-14  11532.070312  11718.280273  11450.889648  11615.929688
1985  2008-08-13  11632.809570  11633.780273  11453.339844  11532.959961
1986  2008-08-12  11781.700195  11782.349609  11601.519531  11642.469727
1987  2008-08-11  11729.669922  11867.110352  11675.530273  11782.349609
1988  2008-08-08  11432.089844  11759.959961  11388.040039  11734.320312

         Volume     Adj Close
0      82160000  17949.369141
1     133030000  17929.990234
2     106380000  17694.679688
3     112190000  17409.720703
4     138740000  17140.240234
...         ...           ...
1984  159790000  11615.929688
1985  182550000  11532.959961
1986  173590000  11642.469727
1987  183190000  11782.349609
1988  212830000  11734.320312

[1989 rows x 7 columns]

In [29]:
l=['Open','High', 'Low']
data2.loc[2,l]

Open    17456.019531
High    17704.509766
Low     17456.019531
Name: 2, dtype: object

In [30]:
data2[l]

              Open          High           Low
0     17924.240234  18002.380859  17916.910156
1     17712.759766  17930.609375  17711.800781
2     17456.019531  17704.509766  17456.019531
3     17190.509766           NaN           NaN
4     17355.210938           NaN  17063.080078
...            ...           ...           ...
1984  11532.070312  11718.280273  11450.889648
1985  11632.809570  11633.780273  11453.339844
1986  11781.700195  11782.349609  11601.519531
1987  11729.669922  11867.110352  11675.530273
1988  11432.089844  11759.959961  11388.040039

[1989 rows x 3 columns]

In [31]:
# d=pd.DataFrame(data2, index=[4], columns=[0])
# d
# print(data2[data2.index==3]) #if we want to print only row 3
print(data2[data2.index.isin(range(1,10))])  #print first 10 row without using loc and iloc func

         Date          Open          High           Low         Close  \
1  2016-06-30  17712.759766  17930.609375  17711.800781  17929.990234
2  2016-06-29  17456.019531  17704.509766  17456.019531  17694.679688
3  2016-06-28  17190.509766           NaN           NaN  17409.720703
4  2016-06-27  17355.210938           NaN  17063.080078  17140.240234
5  2016-06-24  17946.630859           NaN  17356.339844  17400.750000
6  2016-06-23  17844.109375  18011.070312  17844.109375  18011.070312
7  2016-06-22  17832.669922  17920.160156  17770.359375  17780.830078
8  2016-06-21  17827.330078  17877.839844  17799.800781  17829.730469
9  2016-06-20  17736.869141  17946.359375  17736.869141  17804.869141

      Volume     Adj Close
1  133030000  17929.990234
2  106380000  17694.679688
3  112190000  17409.720703
4  138740000  17140.240234
5  239000000  17400.750000
6   98070000  18011.070312
7   89440000  17780.830078
8   85130000  17829.730469
9   99380000  17804.869141

# print all the values of High column where High values are greater than average of High column values

In [32]:
# print(data2.loc[data2.High > data2.High.mean(), 'High'])

avg=data2['High'].mean()
d =data2['High'] > avg, 'High'  #filter the values in the form of booleans.
data2.loc[d]

0      18002.380859
1      17930.609375
2      17704.509766
6      18011.070312
7      17920.160156
           ...
951    13626.480469
952    13582.120117
953    13593.150391
954    13653.240234
955    13573.330078
Name: High, Length: 889, dtype: float64

In [33]:
# data2['High']  #data2.High
# data2.High
data2.columns

Index(['Date', 'Open', 'High', 'Low', 'Close', 'Volume', 'Adj Close'], dtype='object')

# print all the columns where the opening share price is less than the median opening price for the given stock and print all the rows in the dataset

In [34]:
# pd.set_option("display.max_rows", None)
print(data2.loc[data2.Open < data2.Open.median(), data2.columns[1:4]])

              Open          High           Low
882   12938.190430  13109.129883  12883.889648
899   12948.959961  13089.110352  12923.440430
900   12966.450195  13022.509766  12940.070312
903   12977.349609  13062.559570  12961.919922
904   12875.559570  12989.099609  12765.320312
...            ...           ...           ...
1984  11532.070312  11718.280273  11450.889648
1985  11632.809570  11633.780273  11453.339844
1986  11781.700195  11782.349609  11601.519531
1987  11729.669922  11867.110352  11675.530273
1988  11432.089844  11759.959961  11388.040039

[994 rows x 3 columns]

In [35]:
df = pd.concat([data2, data2], axis=0)  #by default axis = 0 row-wise
print(df)
df.shape

            Date          Open          High           Low         Close  \
0     2016-07-01  17924.240234  18002.380859  17916.910156  17949.369141
1     2016-06-30  17712.759766  17930.609375  17711.800781  17929.990234
2     2016-06-29  17456.019531  17704.509766  17456.019531  17694.679688
3     2016-06-28  17190.509766           NaN           NaN  17409.720703
4     2016-06-27  17355.210938           NaN  17063.080078  17140.240234
...          ...           ...           ...           ...           ...
1984  2008-08-14  11532.070312  11718.280273  11450.889648  11615.929688
1985  2008-08-13  11632.809570  11633.780273  11453.339844  11532.959961
1986  2008-08-12  11781.700195  11782.349609  11601.519531  11642.469727
1987  2008-08-11  11729.669922  11867.110352  11675.530273  11782.349609
1988  2008-08-08  11432.089844  11759.959961  11388.040039  11734.320312

         Volume     Adj Close
0      82160000  17949.369141
1     133030000  17929.990234
2     106380000  17694.679688
3     112190000  17409.720703
4     138740000  17140.240234
...         ...           ...
1984  159790000  11615.929688
1985  182550000  11532.959961
1986  173590000  11642.469727
1987  183190000  11782.349609
1988  212830000  11734.320312

[3978 rows x 7 columns]

(3978, 7)

In [36]:
df.loc[0]

,Date,Open,High,Low,Close,Volume,Adj Close
0,2016-07-01,17924.240234,18002.380859,17916.910156,17949.369141,82160000,17949.369141
0,2016-07-01,17924.240234,18002.380859,17916.910156,17949.369141,82160000,17949.369141

In [37]:
df.duplicated().sum()

1989

In [38]:
df.drop_duplicates(inplace=True) #permanent remove in original data also

In [39]:
df

,Date,Open,High,Low,Close,Volume,Adj Close
0,2016-07-01,17924.240234,18002.380859,17916.910156,17949.369141,82160000,17949.369141
1,2016-06-30,17712.759766,17930.609375,17711.800781,17929.990234,133030000,17929.990234
2,2016-06-29,17456.019531,17704.509766,17456.019531,17694.679688,106380000,17694.679688
3,2016-06-28,17190.509766,NaN,NaN,17409.720703,112190000,17409.720703
4,2016-06-27,17355.210938,NaN,17063.080078,17140.240234,138740000,17140.240234
...,...,...,...,...,...,...,...
1984,2008-08-14,11532.070312,11718.280273,11450.889648,11615.929688,159790000,11615.929688
1985,2008-08-13,11632.809570,11633.780273,11453.339844,11532.959961,182550000,11532.959961
1986,2008-08-12,11781.700195,11782.349609,11601.519531,11642.469727,173590000,11642.469727
1987,2008-08-11,11729.669922,11867.110352,11675.530273,11782.349609,183190000,11782.349609
1988,2008-08-08,11432.089844,11759.959961,11388.040039,11734.320312,212830000,11734.320312

# IMDB DATASET

In [40]:
df1=pd.read_csv("C:\\Users\\Shyam Singh\\Downloads\\archive (1)\\imdb_top_1000.csv")
df1

,Poster_Link,Series_Title,Released_Year,Certificate,Runtime,Genre,IMDB_Rating,Overview,Meta_score,Director,Star1,Star2,Star3,Star4,No_of_Votes,Gross
0,https://m.media-amazon.com/images/M/MV5BMDFkYT...,The Shawshank Redemption,1994,A,142 min,Drama,9.3,Two imprisoned men bond over a number of years...,80.0,Frank Darabont,Tim Robbins,Morgan Freeman,Bob Gunton,William Sadler,2343110,"28,341,469"
1,https://m.media-amazon.com/images/M/MV5BM2MyNj...,The Godfather,1972,A,175 min,"Crime, Drama",9.2,An organized crime dynasty's aging patriarch t...,100.0,Francis Ford Coppola,Marlon Brando,Al Pacino,James Caan,Diane Keaton,1620367,"134,966,411"
2,https://m.media-amazon.com/images/M/MV5BMTMxNT...,The Dark Knight,2008,UA,152 min,"Action, Crime, Drama",9.0,When the menace known as the Joker wreaks havo...,84.0,Christopher Nolan,Christian Bale,Heath Ledger,Aaron Eckhart,Michael Caine,2303232,"534,858,444"
3,https://m.media-amazon.com/images/M/MV5BMWMwMG...,The Godfather: Part II,1974,A,202 min,"Crime, Drama",9.0,The early life and career of Vito Corleone in ...,90.0,Francis Ford Coppola,Al Pacino,Robert De Niro,Robert Duvall,Diane Keaton,1129952,"57,300,000"
4,https://m.media-amazon.com/images/M/MV5BMWU4N2...,12 Angry Men,1957,U,96 min,"Crime, Drama",9.0,A jury holdout attempts to prevent a miscarria...,96.0,Sidney Lumet,Henry Fonda,Lee J. Cobb,Martin Balsam,John Fiedler,689845,"4,360,000"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,https://m.media-amazon.com/images/M/MV5BNGEwMT...,Breakfast at Tiffany's,1961,A,115 min,"Comedy, Drama, Romance",7.6,A young New York socialite becomes interested ...,76.0,Blake Edwards,Audrey Hepburn,George Peppard,Patricia Neal,Buddy Ebsen,166544,NaN
996,https://m.media-amazon.com/images/M/MV5BODk3Yj...,Giant,1956,G,201 min,"Drama, Western",7.6,Sprawling epic covering the life of a Texas ca...,84.0,George Stevens,Elizabeth Taylor,Rock Hudson,James Dean,Carroll Baker,34075,NaN
997,https://m.media-amazon.com/images/M/MV5BM2U3Yz...,From Here to Eternity,1953,Passed,118 min,"Drama, Romance, War",7.6,"In Hawaii in 1941, a private is cruelly punish...",85.0,Fred Zinnemann,Burt Lancaster,Montgomery Clift,Deborah Kerr,Donna Reed,43374,"30,500,000"
998,https://m.media-amazon.com/images/M/MV5BZTBmMj...,Lifeboat,1944,NaN,97 min,"Drama, War",7.6,Several survivors of a torpedoed merchant ship...,78.0,Alfred Hitchcock,Tallulah Bankhead,John Hodiak,Walter Slezak,William Bendix,26471,NaN
999,https://m.media-amazon.com/images/M/MV5BMTY5OD...,The 39 Steps,1935,NaN,86 min,"Crime, Mystery, Thriller",7.6,A man in London tries to help a counter-espion...,93.0,Alfred Hitchcock,Robert Donat,Madeleine Carroll,Lucie Mannheim,Godfrey Tearle,51853,NaN

In [41]:
df1.shape

(1000, 16)

In [42]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 16 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Poster_Link    1000 non-null   object
 1   Series_Title   1000 non-null   object
 2   Released_Year  1000 non-null   object
 3   Certificate    899 non-null    object
 4   Runtime        1000 non-null   object
 5   Genre          1000 non-null   object
 6   IMDB_Rating    1000 non-null   float64
 7   Overview       1000 non-null   object
 8   Meta_score     843 non-null    float64
 9   Director       1000 non-null   object
 10  Star1          1000 non-null   object
 11  Star2          1000 non-null   object
 12  Star3          1000 non-null   object
 13  Star4          1000 non-null   object
 14  No_of_Votes    1000 non-null   int64
 15  Gross          831 non-null    object
dtypes: float64(2), int64(1), object(13)
memory usage: 125.1+ KB

In [43]:
df1.describe()

       IMDB_Rating  Meta_score   No_of_Votes
count  1000.000000  843.000000  1.000000e+03
mean      7.949300   77.971530  2.736929e+05
std       0.275491   12.376099  3.273727e+05
min       7.600000   28.000000  2.508800e+04
25%       7.700000   70.000000  5.552625e+04
50%       7.900000   79.000000  1.385485e+05
75%       8.100000   87.000000  3.741612e+05
max       9.300000  100.000000  2.343110e+06

In [44]:
print(df1.isnull().sum())

df1.isnull().sum().sum()  #total NaN values in the dataset

Poster_Link        0
Series_Title       0
Released_Year      0
Certificate      101
Runtime            0
Genre              0
IMDB_Rating        0
Overview           0
Meta_score       157
Director           0
Star1              0
Star2              0
Star3              0
Star4              0
No_of_Votes        0
Gross            169
dtype: int64

427

In [45]:
df1['Genre'].describe()

count      1000
unique      202
top       Drama
freq         85
Name: Genre, dtype: object

In [46]:
df1['Certificate'].describe()

count     899
unique     16
top         U
freq      234
Name: Certificate, dtype: object

In [47]:
df1["Certificate"].isna()

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998     True
999     True
Name: Certificate, Length: 1000, dtype: bool

In [48]:
# Filter rows where Certificate is NaN
filtered_df = df1[df1["Certificate"].isna()]
filtered_df

,Poster_Link,Series_Title,Released_Year,Certificate,Runtime,Genre,IMDB_Rating,Overview,Meta_score,Director,Star1,Star2,Star3,Star4,No_of_Votes,Gross
30,https://m.media-amazon.com/images/M/MV5BYjBmYT...,Seppuku,1962,NaN,133 min,"Action, Drama, Mystery",8.6,When a ronin requesting seppuku at a feudal lo...,85.0,Masaki Kobayashi,Tatsuya Nakadai,Akira Ishihama,Shima Iwashita,Tetsurô Tanba,42004,NaN
54,https://m.media-amazon.com/images/M/MV5BNWJhMD...,Ayla: The Daughter of War,2017,NaN,125 min,"Biography, Drama, History",8.4,"In 1950, amid-st the ravages of the Korean War...",NaN,Can Ulkay,Erdem Can,Çetin Tekindor,Ismail Hacioglu,Kyung-jin Lee,34112,NaN
77,https://m.media-amazon.com/images/M/MV5BOTI4NT...,Tengoku to jigoku,1963,NaN,143 min,"Crime, Drama, Mystery",8.4,An executive of a shoe company becomes a victi...,NaN,Akira Kurosawa,Toshirô Mifune,Yutaka Sada,Tatsuya Nakadai,Kyôko Kagawa,34357,NaN
92,https://m.media-amazon.com/images/M/MV5BNjAzMz...,Babam ve Oglum,2005,NaN,112 min,"Drama, Family",8.3,The family of a left-wing journalist is torn a...,NaN,Çagan Irmak,Çetin Tekindor,Fikret Kuskan,Hümeyra,Ege Tanman,78925,NaN
121,https://m.media-amazon.com/images/M/MV5BZmM0NG...,Ikiru,1952,NaN,143 min,Drama,8.3,A bureaucrat tries to find a meaning in his li...,NaN,Akira Kurosawa,Takashi Shimura,Nobuo Kaneko,Shin'ichi Himori,Haruo Tanaka,68463,"55,240"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
920,https://m.media-amazon.com/images/M/MV5BMjEzMj...,The Secret of Kells,2009,NaN,71 min,"Animation, Adventure, Family",7.6,A young boy in a remote medieval outpost under...,81.0,Tomm Moore,Nora Twomey,Evan McGuire,Brendan Gleeson,Mick Lally,31779,"686,383"
926,https://m.media-amazon.com/images/M/MV5BMTI5Mz...,Dead Man's Shoes,2004,NaN,90 min,"Crime, Drama, Thriller",7.6,A disaffected soldier returns to his hometown ...,52.0,Shane Meadows,Paddy Considine,Gary Stretch,Toby Kebbell,Stuart Wolfenden,49728,"6,013"
944,https://m.media-amazon.com/images/M/MV5BMDc2MG...,Batoru rowaiaru,2000,NaN,114 min,"Action, Adventure, Drama",7.6,"In the future, the Japanese government capture...",81.0,Kinji Fukasaku,Tatsuya Fujiwara,Aki Maeda,Tarô Yamamoto,Takeshi Kitano,169091,NaN
998,https://m.media-amazon.com/images/M/MV5BZTBmMj...,Lifeboat,1944,NaN,97 min,"Drama, War",7.6,Several survivors of a torpedoed merchant ship...,78.0,Alfred Hitchcock,Tallulah Bankhead,John Hodiak,Walter Slezak,William Bendix,26471,NaN
999,https://m.media-amazon.com/images/M/MV5BMTY5OD...,The 39 Steps,1935,NaN,86 min,"Crime, Mystery, Thriller",7.6,A man in London tries to help a counter-espion...,93.0,Alfred Hitchcock,Robert Donat,Madeleine Carroll,Lucie Mannheim,Godfrey Tearle,51853,NaN

In [49]:


# Count the frequency of each Genre value in the filtered DataFrame
genre_frequency = filtered_df["Genre"].value_counts()

print(genre_frequency)

Drama                           13
Comedy, Drama                    8
Drama, War                       6
Action, Crime, Drama             4
Drama, Romance                   3
Crime, Drama, Mystery            3
Crime, Drama, Thriller           3
Action, Drama, Thriller          3
Mystery, Thriller                3
Drama, Thriller                  3
Crime, Drama                     3
Drama, Horror                    2
Crime, Drama, Romance            2
Crime, Drama, Film-Noir          2
Comedy, Drama, Romance           2
Drama, Music, Romance            2
Comedy, Romance                  2
Drama, Horror, Thriller          2
Comedy, Drama, War               2
Horror, Thriller                 1
Action, Adventure, War           1
Comedy, Musical, War             1
Drama, Horror, Sci-Fi            1
Comedy, Crime                    1
Action, Adventure, Crime         1
Thriller                         1
Animation, Adventure, Family     1
Action, Crime, Thriller          1
Fantasy, Horror                  1
Action, Adventure, Drama         1
Comedy, Drama, Family            1
Crime, Drama, Fantasy            1
Action, Drama, Mystery           1
Action, Adventure, Biography     1
Fantasy, Horror, Mystery         1
Drama, Family                    1
Drama, Sci-Fi                    1
Animation, Comedy, Drama         1
Drama, Fantasy                   1
Drama, Western                   1
Adventure, Drama                 1
Drama, History                   1
Adventure, Comedy, Sci-Fi        1
Drama, Fantasy, Mystery          1
Action, Crime, Comedy            1
Crime, Drama, Horror             1
Biography, Drama, History        1
Drama, Film-Noir, Mystery        1
Comedy, Crime, Thriller          1
Film-Noir, Mystery               1
Drama, History, Thriller         1
Crime, Mystery, Thriller         1
Name: Genre, dtype: int64

In [50]:
cvbn=df1.loc[df1['Genre']=='Drama', ['Genre', 'Certificate']].mode()
cvbn

   Genre Certificate
0  Drama           R

In [51]:
x=cvbn.loc[0, 'Certificate']
print(x)

R

In [52]:
# Find rows where Genre is "Drama" and Certificate is NaN
drama_nan_rows = df1[(df1["Genre"] == "Drama") & df1["Certificate"].isna()]
drama_nan_rows.index

Int64Index([121, 122, 206, 302, 370, 432, 433, 443, 492, 589, 619, 636, 742], dtype='int64')

In [53]:
# Fill the NaN values in Certificate column for Drama rows with a specific value x=R
df1.loc[drama_nan_rows.index, "Certificate"] = x

In [54]:
# print(df1['Certificate'].fillna(x, inplace=True))  #fill x=R for all NaN values in the column

In [55]:
df1['Certificate'].isnull().sum()

88

In [56]:
cvbn1=df1.loc[df1['Genre']=='Comedy, Drama', ['Genre', 'Certificate']].mode()
cvbn1

           Genre Certificate
0  Comedy, Drama           R

In [57]:
x2=cvbn1.loc[0, 'Certificate']
print(x2)

R

In [58]:
# Find rows where Genre is "Comedy, Drama" and Certificate is NaN
drama_nan_rows = df1[(df1["Genre"] == "Comedy, Drama") & df1["Certificate"].isna()]
# drama_nan_rows.index
# Fill the NaN values in Certificate column for Drama rows with a specific value x=R
df1.loc[drama_nan_rows.index, "Certificate"] = x2

In [59]:
df1['Certificate'].isnull().sum()

80

In [60]:
cvbn3=df1.loc[df1['Genre']=='Drama, War', ['Genre', 'Certificate']].mode()
x3=cvbn3.loc[0, 'Certificate']
# Find rows where Genre is "Comedy, Drama" and Certificate is NaN
drama_nan_rows = df1[(df1["Genre"] == "Drama, War") & df1["Certificate"].isna()]
# drama_nan_rows.index
# Fill the NaN values in Certificate column for Drama rows with a specific value x=R
df1.loc[drama_nan_rows.index, "Certificate"] = x3

In [61]:
cvbn4=df1.loc[df1['Genre']=='Action, Crime, Drama', ['Genre', 'Certificate']].mode()
x4=cvbn4.loc[0, 'Certificate']
# Find rows where Genre is "Comedy, Drama" and Certificate is NaN
drama_nan_rows = df1[(df1["Genre"] == "Action, Crime, Drama") & df1["Certificate"].isna()]
# drama_nan_rows.index
# Fill the NaN values in Certificate column for Drama rows with a specific value x=R
df1.loc[drama_nan_rows.index, "Certificate"] = x4

In [62]:
df1['Certificate'].isnull().sum()

70

In [63]:
# Genres to exclude
# excluded_genres = ['Comedy, Drama', 'Drama', 'Drama, War', 'Action, Crime, Drama']

# Filter rows with genres not in the excluded list
# filtered_df1 = df1[~df1['Genre'].isin(excluded_genres)]

# Group by Genre and calculate the mode of 'Certificate'

In [64]:
print(df1['Certificate'].fillna('R', inplace=True))  #fill x=R for all NaN values in the column
df1['Certificate'].isnull().sum()

None

0

In [65]:
df1.isnull().sum()  #now NaN is in the cols of Meta_score and Gross

Poster_Link        0
Series_Title       0
Released_Year      0
Certificate        0
Runtime            0
Genre              0
IMDB_Rating        0
Overview           0
Meta_score       157
Director           0
Star1              0
Star2              0
Star3              0
Star4              0
No_of_Votes        0
Gross            169
dtype: int64

In [66]:
import pandas as pd

# Calculate correlations
correlation_matrix = df1.corr()

# Print the correlation of Meta_score with other columns
meta_score_correlations = correlation_matrix['Meta_score'].sort_values(ascending=False)

print(meta_score_correlations)

Meta_score     1.000000
IMDB_Rating    0.268531
No_of_Votes   -0.018507
Name: Meta_score, dtype: float64

C:\Users\Shyam Singh\AppData\Local\Temp\ipykernel_8980\1289437242.py:4: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  correlation_matrix = df1.corr()

In [67]:
mean_meta_score = df1['Meta_score'].mean()
df1['Meta_score'].fillna(mean_meta_score, inplace=True)

In [68]:
df1.isnull().sum()

Poster_Link        0
Series_Title       0
Released_Year      0
Certificate        0
Runtime            0
Genre              0
IMDB_Rating        0
Overview           0
Meta_score         0
Director           0
Star1              0
Star2              0
Star3              0
Star4              0
No_of_Votes        0
Gross            169
dtype: int64

In [69]:
# Assuming df is your DataFrame
df1['Gross'] = df1['Gross'].str.replace(',', '')  # Remove commas

df1['Gross'] = pd.to_numeric(df1['Gross'], errors='coerce', downcast='float')

In [70]:
df1.describe()

       IMDB_Rating  Meta_score   No_of_Votes         Gross
count  1000.000000  1000.00000  1.000000e+03  8.310000e+02
mean      7.949300    77.97153  2.736929e+05  6.803475e+07
std       0.275491    11.36206  3.273727e+05  1.097500e+08
min       7.600000    28.00000  2.508800e+04  1.305000e+03
25%       7.700000    72.00000  5.552625e+04  3.253559e+06
50%       7.900000    77.97153  1.385485e+05  2.353089e+07
75%       8.100000    85.25000  3.741612e+05  8.075089e+07
max       9.300000   100.00000  2.343110e+06  9.366622e+08

In [71]:
correlation_matrix = df1.corr()
gross_correlations = correlation_matrix['Gross'].sort_values(ascending=False)
print(gross_correlations)

Gross          1.000000
No_of_Votes    0.574393
IMDB_Rating    0.095923
Meta_score    -0.032455
Name: Gross, dtype: float64

C:\Users\Shyam Singh\AppData\Local\Temp\ipykernel_8980\2083369208.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  correlation_matrix = df1.corr()

In [81]:

# Calculate mean 'Gross' for each 'No_of_Votes' group
grouped_gross_mean = df1.groupby('IMDB_Rating')['Gross'].transform('mean')

# Print the calculated mean values for verification
print(grouped_gross_mean)

# Fill NaN values in 'Gross' using the grouped mean
df1['Gross'].fillna(grouped_gross_mean, inplace=True)

0      2.834147e+07
1      1.349664e+08
2      1.988395e+08
3      1.988395e+08
4      1.988395e+08
           ...
995    7.010455e+07
996    7.010455e+07
997    7.010455e+07
998    7.010455e+07
999    7.010455e+07
Name: Gross, Length: 1000, dtype: float64

In [82]:
df1.isnull().sum()

Poster_Link      0
Series_Title     0
Released_Year    0
Certificate      0
Runtime          0
Genre            0
IMDB_Rating      0
Overview         0
Meta_score       0
Director         0
Star1            0
Star2            0
Star3            0
Star4            0
No_of_Votes      0
Gross            0
dtype: int64